In [1]:
import pandas as pd

In [2]:
ls_1 = ["Mahmoud","Ahmed","Ali","Hassan","Tarek","Ibrahim","Khalid"]

In [3]:
ls_2 = [5,10,15,20,25,30,35,40,45]

# Series Function

In [4]:
ser_1 = pd.Series(ls_1)

In [5]:
print (ls_1)

['Mahmoud', 'Ahmed', 'Ali', 'Hassan', 'Tarek', 'Ibrahim', 'Khalid']

In [6]:
print (ser_1)

0    Mahmoud
1      Ahmed
2        Ali
3     Hassan
4      Tarek
5    Ibrahim
6     Khalid
dtype: object

In [7]:
ser_2 = pd.Series(ls_2)

In [8]:
print (ls_2)

[5, 10, 15, 20, 25, 30, 35, 40, 45]

In [9]:
print (ser_2)

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
dtype: int64

In [10]:
ls_5 = ["Ali","Ali","Ali","Ali","Tarek","Mahmoud","Khalid"]

In [11]:
ser_5 = pd.Series(ls_1)

In [12]:
ser_5.describe()

count           7
unique          7
top       Mahmoud
freq            1
dtype: object

In [13]:
ser_3 = pd.Series(ls_1,index = ["a","b","c","d","e","f","g"])

In [14]:
print (ser_3)

a    Mahmoud
b      Ahmed
c        Ali
d     Hassan
e      Tarek
f    Ibrahim
g     Khalid
dtype: object

In [15]:
print (ser_3.values)

['Mahmoud' 'Ahmed' 'Ali' 'Hassan' 'Tarek' 'Ibrahim' 'Khalid']

In [16]:
print (ser_3.index)

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

# Describe Function

In [2]:
#25%Quarter 1
#50%Quarter 2
#75%Quarter 3

In [17]:
print (ser_2.describe())

count     9.000000
mean     25.000000
std      13.693064
min       5.000000
25%      15.000000
50%      25.000000
75%      35.000000
max      45.000000
dtype: float64

In [18]:
print (ser_3.describe())

count           7
unique          7
top       Mahmoud
freq            1
dtype: object

In [19]:
ser_3.nunique()

7

In [20]:
print (ser_2.mean())

25.0

In [21]:
print (ser_2.std())

13.693063937629153

In [22]:
#aggregation
print (ser_2.agg(['mean','std','sum']))

mean     25.000000
std      13.693064
sum     225.000000
dtype: float64

In [23]:
print (ser_2.count())

9

# DataFrame Function

In [24]:
frame_1 = pd.DataFrame(ser_2)

In [25]:
print (frame_1)

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45

In [26]:
frame_2 = pd.DataFrame(ls_2,index = ["a","b","c","d","e","f","g","h","i"])

In [27]:
frame_2

    0
a   5
b  10
c  15
d  20
e  25
f  30
g  35
h  40
i  45

In [28]:
frame_2 = pd.DataFrame(ls_2,columns = ["first"])

In [29]:
frame_2

   first
0      5
1     10
2     15
3     20
4     25
5     30
6     35
7     40
8     45

In [30]:
frame_2 = pd.DataFrame(ls_2,index = ["a","b","c","d","e","f","g","h","i"],columns = ["first"])

In [31]:
frame_2

   first
a      5
b     10
c     15
d     20
e     25
f     30
g     35
h     40
i     45

In [32]:
frame_2.values

array([[ 5],
       [10],
       [15],
       [20],
       [25],
       [30],
       [35],
       [40],
       [45]], dtype=int64)

In [33]:
frame_2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'], dtype='object')

In [34]:
frame_2.columns

Index(['first'], dtype='object')

In [35]:
frame_2.describe()

           first
count   9.000000
mean   25.000000
std    13.693064
min     5.000000
25%    15.000000
50%    25.000000
75%    35.000000
max    45.000000

In [36]:
frame_2.mean()

first    25.0
dtype: float64

In [37]:
lest1 = [10,20,30]
lest2 = [100,200,300]
lest3 = [1000,2000,3000]

In [38]:
df_1 = pd.DataFrame([lest1,lest2,lest3],columns = ["first","second","third"])

In [39]:
df_1

   first  second  third
0     10      20     30
1    100     200    300
2   1000    2000   3000

In [40]:
cl1 = ["Ahmed",2000,1500, 1200558899,"cl1@gmail.com","Yes"]
cl2 = ["Mohamed",3000,2500,1200995782,"cl2@gmail.com","No"]
cl3 = ["Mahmoud",5000,2000,1129357196,"cl3@gmail.com","Yes"]
cl4 = ["Khalid",4000,1000,123941594,"cl4@gmail.com","Yes"]
cl5 = ["Tarek",3500,3000,1559313188,"cl5@gmail.com","No"]

In [41]:
df_2 = pd.DataFrame([cl1,cl2,cl3,cl4,cl5],columns = ["Name","Income","WithDraw","Phone","Email","Active"])

In [42]:
df_2

      Name  Income  WithDraw       Phone          Email Active
0    Ahmed    2000      1500  1200558899  cl1@gmail.com    Yes
1  Mohamed    3000      2500  1200995782  cl2@gmail.com     No
2  Mahmoud    5000      2000  1129357196  cl3@gmail.com    Yes
3   Khalid    4000      1000   123941594  cl4@gmail.com    Yes
4    Tarek    3500      3000  1559313188  cl5@gmail.com     No

In [43]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Income    5 non-null      int64
 2   WithDraw  5 non-null      int64
 3   Phone     5 non-null      int64
 4   Email     5 non-null      object
 5   Active    5 non-null      object
dtypes: int64(3), object(3)
memory usage: 368.0+ bytes

In [44]:
df_2.isna()

    Name  Income  WithDraw  Phone  Email  Active
0  False   False     False  False  False   False
1  False   False     False  False  False   False
2  False   False     False  False  False   False
3  False   False     False  False  False   False
4  False   False     False  False  False   False

In [45]:
df_2.isna().sum()

Name        0
Income      0
WithDraw    0
Phone       0
Email       0
Active      0
dtype: int64

In [46]:
df_2.describe()

            Income     WithDraw         Phone
count     5.000000     5.000000  5.000000e+00
mean   3500.000000  2000.000000  1.042833e+09
std    1118.033989   790.569415  5.404842e+08
min    2000.000000  1000.000000  1.239416e+08
25%    3000.000000  1500.000000  1.129357e+09
50%    3500.000000  2000.000000  1.200559e+09
75%    4000.000000  2500.000000  1.200996e+09
max    5000.000000  3000.000000  1.559313e+09

In [47]:
df_2["Name"]

0      Ahmed
1    Mohamed
2    Mahmoud
3     Khalid
4      Tarek
Name: Name, dtype: object

In [48]:
df_2["Email"]

0    cl1@gmail.com
1    cl2@gmail.com
2    cl3@gmail.com
3    cl4@gmail.com
4    cl5@gmail.com
Name: Email, dtype: object

In [49]:
df_2["Email"].describe()

count                 5
unique                5
top       cl1@gmail.com
freq                  1
Name: Email, dtype: object

In [50]:
df_2.loc[0:3,"Name":"Phone"]

      Name  Income  WithDraw       Phone
0    Ahmed    2000      1500  1200558899
1  Mohamed    3000      2500  1200995782
2  Mahmoud    5000      2000  1129357196
3   Khalid    4000      1000   123941594

In [51]:
df_2.iloc[0:4,0:4]

      Name  Income  WithDraw       Phone
0    Ahmed    2000      1500  1200558899
1  Mohamed    3000      2500  1200995782
2  Mahmoud    5000      2000  1129357196
3   Khalid    4000      1000   123941594

In [52]:
df_2.drop(["Phone","Email","Active"],axis = 1)

      Name  Income  WithDraw
0    Ahmed    2000      1500
1  Mohamed    3000      2500
2  Mahmoud    5000      2000
3   Khalid    4000      1000
4    Tarek    3500      3000

In [53]:
df_2.drop([0,3,4],axis = 0)

      Name  Income  WithDraw       Phone          Email Active
1  Mohamed    3000      2500  1200995782  cl2@gmail.com     No
2  Mahmoud    5000      2000  1129357196  cl3@gmail.com    Yes

# select_dtypes

In [54]:
dt_select = df_2.select_dtypes(include = ["object"])

In [55]:
dt_select

      Name          Email Active
0    Ahmed  cl1@gmail.com    Yes
1  Mohamed  cl2@gmail.com     No
2  Mahmoud  cl3@gmail.com    Yes
3   Khalid  cl4@gmail.com    Yes
4    Tarek  cl5@gmail.com     No

In [56]:
dt_select = df_2.select_dtypes(exclude = ["object"])

In [57]:
dt_select

   Income  WithDraw       Phone
0    2000      1500  1200558899
1    3000      2500  1200995782
2    5000      2000  1129357196
3    4000      1000   123941594
4    3500      3000  1559313188

# dropna function

In [58]:
cl_1 = ["Ahmed",2000,None, 1200558899,"cl1@gmail.com","Yes"]
cl_2 = ["Mohamed",3000,2500,1200995782,"cl2@gmail.com","No"]
cl_3 = ["Mahmoud",5000,2000,1129357196,"cl3@gmail.com","Yes"]
cl_4 = ["Khalid",4000,1000,123941594,None,"Yes"]
cl_5 = ["Tarek",3500,3000,1559313188,"cl5@gmail.com","No"]

In [59]:
df_3 = pd.DataFrame([cl_1,cl_2,cl_3,cl_4,cl_5],columns = ["Name","Income","WithDraw","Phone","Email","Active"])

In [60]:
df_3

      Name  Income  WithDraw       Phone          Email Active
0    Ahmed    2000       NaN  1200558899  cl1@gmail.com    Yes
1  Mohamed    3000    2500.0  1200995782  cl2@gmail.com     No
2  Mahmoud    5000    2000.0  1129357196  cl3@gmail.com    Yes
3   Khalid    4000    1000.0   123941594           None    Yes
4    Tarek    3500    3000.0  1559313188  cl5@gmail.com     No

In [61]:
#     NaN 
df_4 = df_3.dropna()

In [62]:
df_4

      Name  Income  WithDraw       Phone          Email Active
1  Mohamed    3000    2500.0  1200995782  cl2@gmail.com     No
2  Mahmoud    5000    2000.0  1129357196  cl3@gmail.com    Yes
4    Tarek    3500    3000.0  1559313188  cl5@gmail.com     No

# fillna function

In [63]:
df_3.fillna(0,inplace = True)

In [64]:
df_3

      Name  Income  WithDraw       Phone          Email Active
0    Ahmed    2000       0.0  1200558899  cl1@gmail.com    Yes
1  Mohamed    3000    2500.0  1200995782  cl2@gmail.com     No
2  Mahmoud    5000    2000.0  1129357196  cl3@gmail.com    Yes
3   Khalid    4000    1000.0   123941594              0    Yes
4    Tarek    3500    3000.0  1559313188  cl5@gmail.com     No

# concat function

In [65]:
job_data = [['Accountant'],['Driver'],['Develober'],['Engineer'],['Doctor']]

In [66]:
job = pd.DataFrame (job_data,columns = ['job'])

In [67]:
data_con = pd.concat ([df_3,job],axis = 1)

In [68]:
data_con

      Name  Income  WithDraw       Phone          Email Active         job
0    Ahmed    2000       0.0  1200558899  cl1@gmail.com    Yes  Accountant
1  Mohamed    3000    2500.0  1200995782  cl2@gmail.com     No      Driver
2  Mahmoud    5000    2000.0  1129357196  cl3@gmail.com    Yes   Develober
3   Khalid    4000    1000.0   123941594              0    Yes    Engineer
4    Tarek    3500    3000.0  1559313188  cl5@gmail.com     No      Doctor

# insert function

In [69]:
data_con.insert (1,"Level",[1,2,4,3,1])

In [70]:
data_con

,Name,Level,Income,WithDraw,Phone,Email,Active,job
0,Ahmed,1,2000,0.0,1200558899,cl1@gmail.com,Yes,Accountant
1,Mohamed,2,3000,2500.0,1200995782,cl2@gmail.com,No,Driver
2,Mahmoud,4,5000,2000.0,1129357196,cl3@gmail.com,Yes,Develober
3,Khalid,3,4000,1000.0,123941594,0,Yes,Engineer
4,Tarek,1,3500,3000.0,1559313188,cl5@gmail.com,No,Doctor

# merge function

In [71]:
#

In [72]:
team = [['Mahmoud',20],['Ahmed',25],['Khalid',30],['Mohamed',60],['Tarek',22]]

In [73]:
df_team = pd.DataFrame (team,columns = ['Name','Age'])

In [74]:
df_team

      Name  Age
0  Mahmoud   20
1    Ahmed   25
2   Khalid   30
3  Mohamed   60
4    Tarek   22

In [75]:
merge = pd.merge(data_con,df_team)

In [76]:
merge

,Name,Level,Income,WithDraw,Phone,Email,Active,job,Age
0,Ahmed,1,2000,0.0,1200558899,cl1@gmail.com,Yes,Accountant,25
1,Mohamed,2,3000,2500.0,1200995782,cl2@gmail.com,No,Driver,60
2,Mahmoud,4,5000,2000.0,1129357196,cl3@gmail.com,Yes,Develober,20
3,Khalid,3,4000,1000.0,123941594,0,Yes,Engineer,30
4,Tarek,1,3500,3000.0,1559313188,cl5@gmail.com,No,Doctor,22

In [77]:
merge.to_csv('merge.csv')

In [3]:
data = pd.read_csv ('Mahmoud.csv')

In [4]:
data

,Unnamed: 0,Name,Level,Income,WithDraw,Phone,Email,Active,job,Age
0,0,Ahmed,1,2000,0.0,1200558899,cl1@gmail.com,Yes,Accountant,25
1,1,Mohamed,2,3000,2500.0,1200995782,cl2@gmail.com,No,Driver,60
2,2,Mahmoud,4,5000,2000.0,1129357196,cl3@gmail.com,Yes,Develober,20
3,3,Khalid,3,4000,1000.0,123941594,0,Yes,Engineer,30
4,4,Tarek,1,3500,3000.0,1559313188,cl5@gmail.com,No,Doctor,22